app/controllers/answers_controller.rb

  def update
    if @answer.update answer_params
---
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "Ну бывает Sdasd"], ["updated_at", "2022-09-13 09:39:11.977221"], ["id", 6]]

  def set_answer!
    @answer = @question.answers.find params[:id]
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 2], ["id", 6], ["LIMIT", 1]]