app/controllers/answers_controller.rb

  def create
    @answer = @question.answers.build answer_params

    Print.ppp @question

    if @answer.save
      flash[:success] = "Answer created!"
      redirect_to question_path(@question)
    else
      @answers = Answer.order created_at: :desc
---
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "qweqwe"], ["question_id", 3], ["created_at", "2022-09-11 18:53:21.075893"], ["updated_at", "2022-09-11 18:53:21.075893"]]
SELECT "answers".* FROM "answers" ORDER BY "answers"."created_at" DESC

  def destroy
    answer = @question.answers.find params[:id]
    answer.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]

  def set_question!
    @question = Question.find params[:question_id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]