app/controllers/questions_controller.rb

  def show
    @answer = @question.answers.build
    @answers = Answer.order created_at: :desc
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 3]]