app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"
---
  def index
    @questions = Question.order(created_at: :desc).page params[:page]

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "123"], ["body", "123"], ["created_at", "2022-08-31 21:31:32.478264"], ["updated_at", "2022-08-31 21:31:32.478264"]]
---
  def create
    @question = Question.new questions_params
    if @question.save

UPDATE "questions" SET "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "My first question!"], ["updated_at", "2022-09-03 14:40:50.225358"], ["id", 1]]
---
  def update
    if @question.update questions_params

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY "answers"."created_at" DESC LIMIT ? OFFSET ?  [["question_id", 18], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 6]]
---
  def show
    @answer = @question.answers.build
    @answers = @question.answers.order(created_at: :desc).page(params[:page])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_question!
    @question = Question.find params[:id]