app/controllers/questions_controller.rb

  def set_question
    @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]